; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x7-y7-t4-k3333-l3333-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f 
        f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f 
        shape0 shape1 shape2 shape3 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
        key2-0 key2-1 key2-2 
        key3-0 key3-1 key3-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f6-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f6-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f6-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f6-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f6-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(place f6-5f)
(place f0-6f)
(place f1-6f)
(place f2-6f)
(place f3-6f)
(place f4-6f)
(place f5-6f)
(place f6-6f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(key key3-0)
(key-shape key3-0 shape3)
(key key3-1)
(key-shape key3-1 shape3)
(key key3-2)
(key-shape key3-2 shape3)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f5-0f f6-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f5-1f f6-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f5-2f f6-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f5-3f f6-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f5-4f f6-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f5-5f f6-5f)
(conn f0-6f f1-6f)
(conn f1-6f f2-6f)
(conn f2-6f f3-6f)
(conn f3-6f f4-6f)
(conn f4-6f f5-6f)
(conn f5-6f f6-6f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f6-0f f6-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f6-1f f6-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f6-2f f6-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f6-3f f6-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f6-4f f6-5f)
(conn f0-5f f0-6f)
(conn f1-5f f1-6f)
(conn f2-5f f2-6f)
(conn f3-5f f3-6f)
(conn f4-5f f4-6f)
(conn f5-5f f5-6f)
(conn f6-5f f6-6f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f6-0f f5-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f6-1f f5-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f6-2f f5-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f6-3f f5-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f6-4f f5-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f6-5f f5-5f)
(conn f1-6f f0-6f)
(conn f2-6f f1-6f)
(conn f3-6f f2-6f)
(conn f4-6f f3-6f)
(conn f5-6f f4-6f)
(conn f6-6f f5-6f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f6-1f f6-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f6-2f f6-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f6-3f f6-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f6-4f f6-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(conn f6-5f f6-4f)
(conn f0-6f f0-5f)
(conn f1-6f f1-5f)
(conn f2-6f f2-5f)
(conn f3-6f f3-5f)
(conn f4-6f f4-5f)
(conn f5-6f f5-5f)
(conn f6-6f f6-5f)
(open f0-0f)
(open f1-0f)
(open f2-0f)
(open f4-0f)
(open f5-0f)
(open f6-0f)
(open f1-1f)
(open f2-1f)
(open f3-1f)
(open f4-1f)
(open f6-1f)
(open f0-2f)
(open f1-2f)
(open f4-2f)
(open f5-2f)
(open f0-3f)
(open f1-3f)
(open f3-3f)
(open f4-3f)
(open f5-3f)
(open f6-3f)
(open f0-4f)
(open f2-4f)
(open f3-4f)
(open f4-4f)
(open f5-4f)
(open f6-4f)
(open f0-5f)
(open f1-5f)
(open f2-5f)
(open f3-5f)
(open f4-5f)
(open f6-5f)
(open f0-6f)
(open f3-6f)
(open f4-6f)
(open f6-6f)
(locked f2-2f)
(lock-shape f2-2f shape0)
(locked f3-2f)
(lock-shape f3-2f shape0)
(locked f2-6f)
(lock-shape f2-6f shape0)
(locked f5-5f)
(lock-shape f5-5f shape1)
(locked f5-6f)
(lock-shape f5-6f shape1)
(locked f1-6f)
(lock-shape f1-6f shape1)
(locked f5-1f)
(lock-shape f5-1f shape2)
(locked f6-2f)
(lock-shape f6-2f shape2)
(locked f3-0f)
(lock-shape f3-0f shape2)
(locked f1-4f)
(lock-shape f1-4f shape3)
(locked f0-1f)
(lock-shape f0-1f shape3)
(locked f2-3f)
(lock-shape f2-3f shape3)
(at key0-0 f2-4f)
(at key0-1 f2-2f)
(at key0-2 f5-4f)
(at key1-0 f4-6f)
(at key1-1 f4-5f)
(at key1-2 f5-0f)
(at key2-0 f1-1f)
(at key2-1 f6-3f)
(at key2-2 f5-4f)
(at key3-0 f2-5f)
(at key3-1 f3-1f)
(at key3-2 f0-5f)
(at-robot f2-1f)
)
(:goal
(and
(at key1-1 f0-4f)
(at key1-2 f4-4f)
(at key2-0 f0-6f)
(at key3-0 f3-3f)
(at key3-1 f5-4f)
(at key3-2 f6-1f)
)
)
)

; plan
1. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 0 of 6
2. (pickup f1-1f key2-0)
   deleted: (at key2-0 f1-1f) (arm-empty)
   added: (holding key2-0)
   goals met: 0 of 6
3. (move f1-1f f2-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 0 of 6
4. (move f2-1f f3-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f3-1f)
   goals met: 0 of 6
5. (pickup-and-loose f3-1f key3-1 key2-0)
   deleted: (holding key2-0) (at key3-1 f3-1f)
   added: (holding key3-1) (at key2-0 f3-1f)
   goals met: 0 of 6
6. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 0 of 6
7. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 0 of 6
8. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 0 of 6
9. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 0 of 6
10. (move f4-4f f5-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f5-4f)
   goals met: 0 of 6
11. (putdown f5-4f key3-1)
   deleted: (holding key3-1)
   added: (arm-empty) (at key3-1 f5-4f)
   goals met: 1 of 6
12. (move f5-4f f4-4f)
   deleted: (at-robot f5-4f)
   added: (at-robot f4-4f)
   goals met: 1 of 6
13. (move f4-4f f4-5f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-5f)
   goals met: 1 of 6
14. (pickup f4-5f key1-1)
   deleted: (at key1-1 f4-5f) (arm-empty)
   added: (holding key1-1)
   goals met: 1 of 6
15. (move f4-5f f3-5f)
   deleted: (at-robot f4-5f)
   added: (at-robot f3-5f)
   goals met: 1 of 6
16. (move f3-5f f2-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 1 of 6
17. (pickup-and-loose f2-5f key3-0 key1-1)
   deleted: (holding key1-1) (at key3-0 f2-5f)
   added: (holding key3-0) (at key1-1 f2-5f)
   goals met: 1 of 6
18. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 1 of 6
19. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 1 of 6
20. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 1 of 6
21. (unlock f3-3f f2-3f key3-0 shape3)
   deleted: (locked f2-3f)
   added: (open f2-3f)
   goals met: 1 of 6
22. (putdown f3-3f key3-0)
   deleted: (holding key3-0)
   added: (arm-empty) (at key3-0 f3-3f)
   goals met: 2 of 6
23. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 2 of 6
24. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 2 of 6
25. (move f4-2f f4-1f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-1f)
   goals met: 2 of 6
26. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 2 of 6
27. (pickup f3-1f key2-0)
   deleted: (at key2-0 f3-1f) (arm-empty)
   added: (holding key2-0)
   goals met: 2 of 6
28. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 2 of 6
29. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 2 of 6
30. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 2 of 6
31. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 2 of 6
32. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 2 of 6
33. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 2 of 6
34. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 2 of 6
35. (move f2-5f f1-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f1-5f)
   goals met: 2 of 6
36. (move f1-5f f0-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f0-5f)
   goals met: 2 of 6
37. (move f0-5f f0-6f)
   deleted: (at-robot f0-5f)
   added: (at-robot f0-6f)
   goals met: 2 of 6
38. (putdown f0-6f key2-0)
   deleted: (holding key2-0)
   added: (arm-empty) (at key2-0 f0-6f)
   goals met: 3 of 6
39. (move f0-6f f0-5f)
   deleted: (at-robot f0-6f)
   added: (at-robot f0-5f)
   goals met: 3 of 6
40. (pickup f0-5f key3-2)
   deleted: (at key3-2 f0-5f) (arm-empty)
   added: (holding key3-2)
   goals met: 3 of 6
41. (move f0-5f f1-5f)
   deleted: (at-robot f0-5f)
   added: (at-robot f1-5f)
   goals met: 3 of 6
42. (move f1-5f f2-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 3 of 6
43. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 3 of 6
44. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 3 of 6
45. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 3 of 6
46. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 3 of 6
47. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 3 of 6
48. (unlock f2-4f f1-4f key3-2 shape3)
   deleted: (locked f1-4f)
   added: (open f1-4f)
   goals met: 3 of 6
49. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 3 of 6
50. (pickup-and-loose f2-5f key1-1 key3-2)
   deleted: (holding key3-2) (at key1-1 f2-5f)
   added: (holding key1-1) (at key3-2 f2-5f)
   goals met: 3 of 6
51. (move f2-5f f1-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f1-5f)
   goals met: 3 of 6
52. (move f1-5f f1-4f)
   deleted: (at-robot f1-5f)
   added: (at-robot f1-4f)
   goals met: 3 of 6
53. (move f1-4f f0-4f)
   deleted: (at-robot f1-4f)
   added: (at-robot f0-4f)
   goals met: 3 of 6
54. (putdown f0-4f key1-1)
   deleted: (holding key1-1)
   added: (arm-empty) (at key1-1 f0-4f)
   goals met: 4 of 6
55. (move f0-4f f1-4f)
   deleted: (at-robot f0-4f)
   added: (at-robot f1-4f)
   goals met: 4 of 6
56. (move f1-4f f2-4f)
   deleted: (at-robot f1-4f)
   added: (at-robot f2-4f)
   goals met: 4 of 6
57. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 4 of 6
58. (pickup f2-5f key3-2)
   deleted: (at key3-2 f2-5f) (arm-empty)
   added: (holding key3-2)
   goals met: 4 of 6
59. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 4 of 6
60. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 4 of 6
61. (move f3-4f f4-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f4-4f)
   goals met: 4 of 6
62. (move f4-4f f4-3f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-3f)
   goals met: 4 of 6
63. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 4 of 6
64. (move f4-2f f4-1f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-1f)
   goals met: 4 of 6
65. (move f4-1f f4-0f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-0f)
   goals met: 4 of 6
66. (move f4-0f f5-0f)
   deleted: (at-robot f4-0f)
   added: (at-robot f5-0f)
   goals met: 4 of 6
67. (move f5-0f f6-0f)
   deleted: (at-robot f5-0f)
   added: (at-robot f6-0f)
   goals met: 4 of 6
68. (move f6-0f f6-1f)
   deleted: (at-robot f6-0f)
   added: (at-robot f6-1f)
   goals met: 4 of 6
69. (putdown f6-1f key3-2)
   deleted: (holding key3-2)
   added: (arm-empty) (at key3-2 f6-1f)
   goals met: 5 of 6
70. (move f6-1f f6-0f)
   deleted: (at-robot f6-1f)
   added: (at-robot f6-0f)
   goals met: 5 of 6
71. (move f6-0f f5-0f)
   deleted: (at-robot f6-0f)
   added: (at-robot f5-0f)
   goals met: 5 of 6
72. (pickup f5-0f key1-2)
   deleted: (at key1-2 f5-0f) (arm-empty)
   added: (holding key1-2)
   goals met: 5 of 6
73. (move f5-0f f4-0f)
   deleted: (at-robot f5-0f)
   added: (at-robot f4-0f)
   goals met: 5 of 6
74. (move f4-0f f4-1f)
   deleted: (at-robot f4-0f)
   added: (at-robot f4-1f)
   goals met: 5 of 6
75. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 5 of 6
76. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 5 of 6
77. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 5 of 6
78. (putdown f4-4f key1-2)
   deleted: (holding key1-2)
   added: (arm-empty) (at key1-2 f4-4f)
   goals met: 6 of 6
